Balanceamento de carga/benchmark/simple-server/#2 REQ-1000 02122023 0921.log
Running 30s test @ http://localhost:3000
1000 connections


┌─────────┬─────────┬─────────┬─────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%    │ 50%     │ 97.5%   │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼─────────┼─────────┼─────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 1407 ms │ 4892 ms │ 9948 ms │ 14819 ms │ 4948.24 ms │ 1781.92 ms │ 15458 ms │
└─────────┴─────────┴─────────┴─────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬─────────┬───────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5% │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼───────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 30      │ 30      │ 174     │ 182   │ 165,87  │ 26,67   │ 30      │
├───────────┼─────────┼─────────┼─────────┼───────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 4.29 kB │ 4.29 kB │ 24.9 kB │ 26 kB │ 23.7 kB │ 3.81 kB │ 4.29 kB │
└───────────┴─────────┴─────────┴─────────┴───────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

18k requests in 30.74s, 712 kB read
12k errors (232 timeouts)